[
  {
    "threat": "Steal Customer Account Info ",
    "threat_description": "Malicious actors attempting to gain unauthorized access to customer account information within a financial system. This sensitive information typically includes personal details, login credentials, and financial data associated with customer accounts. The attackers may employ various techniques such as phishing, malware, or exploiting vulnerabilities in the system to compromise the security of the financial institution.",
    "motives": [
      {
        "motive": "Financial fraud using stolen account info",
        "motive_description": "Engage in financial fraud by exploiting the compromised data. Adversaries aim to leverage the stolen credentials and financial details to conduct unauthorized transactions, initiate fraudulent activities, or gain access to sensitive financial assets. This threat poses a significant risk to both customers and the financial institution, as it can lead to monetary losses, reputational damage, and legal consequences. Preventing and mitigating this threat requires robust security measures, including advanced authentication mechanisms, encryption of sensitive data, and continuous monitoring for suspicious activities.",
        "components": [
          {
            "name": "Hash store/credential database",
            "description": "",
            "sub_components": [
              {
                "name": "Hash store/credential database",
                "dynamic": true,
                "tags": "tier: data; role: iam; match: authentication_type",
                "cwes": [
                  {
                    "cwe_id": "CWE-260: Password in Configuration File"
                  },
                  {
                    "cwe_id": "CWE-522: Insufficiently Protected Credentials"
                  },
                  {
                    "cwe_id": "CWE-256: Plaintext Storage of a Password"
                  },
                  {
                    "cwe_id": "CWE-257: Storing Passwords in a Recoverable Format"
                  },
                  {
                    "cwe_id": "CWE-261: Weak Encoding for Password"
                  },
                  {
                    "cwe_id": "CWE-523: Unprotected Transport of Credentials"
                  },
                  {
                    "cwe_id": "CWE-549: Missing Password Field Masking"
                  },
                  {
                    "cwe_id": "CWE-620: Unverified Password Change"
                  },
                  {
                    "cwe_id": "CWE-798: Use of Hard-coded Credentials"
                  },
                  {
                    "cwe_id": "CWE-259: Use of Hard-coded Password"
                  },
                  {
                    "cwe_id": "CWE-321: Use of Hard-coded Cryptographic Key"
                  },
                  {
                    "cwe_id": "CWE-269: Improper Privilege Management"
                  },
                  {
                    "cwe_id": "CWE-282: Improper Ownership Management"
                  },
                  {
                    "cwe_id": "CWE-285: Improper Authorization"
                  },
                  {
                    "cwe_id": "CWE-286: Incorrect User Management"
                  },
                  {
                    "cwe_id": "CWE-287: Improper Authentication"
                  },
                  {
                    "cwe_id": "CWE-346: Origin Validation Error"
                  },
                  {
                    "cwe_id": "CWE-749: Exposed Dangerous Method or Function"
                  },
                  {
                    "cwe_id": "CWE-923: Improper Restriction of Communication Channel to Intended Endpoints"
                  },
                  {
                    "cwe_id": "CWE-1220: Insufficient Granularity of Access Control"
                  },
                  {
                    "cwe_id": "CWE-732: Incorrect Permission Assignment for Critical Resource"
                  },
                  {
                    "cwe_id": "CWE-276: Incorrect Default Permissions"
                  },
                  {
                    "cwe_id": "CWE-281: Improper Preservation of Permissions"
                  },
                  {
                    "cwe_id": "CWE-766: Critical Data Element Declared Public"
                  },
                  {
                    "cwe_id": "CWE-862: Missing Authorization"
                  },
                  {
                    "cwe_id": "CWE-425: Direct Request ('Forced Browsing')"
                  },
                  {
                    "cwe_id": "CWE-939: Improper Authorization in Handler for Custom URL Scheme"
                  },
                  {
                    "cwe_id": "CWE-863: Incorrect Authorization"
                  },
                  {
                    "cwe_id": "CWE-551: Incorrect Behavior Order: Authorization Before Parsing and Canonicalization"
                  },
                  {
                    "cwe_id": "CWE-639: Authorization Bypass Through User-Controlled Key"
                  },
                  {
                    "cwe_id": "CWE-306: Missing Authentication for Critical Function"
                  },
                  {
                    "cwe_id": "CWE-295: Improper Certificate Validation"
                  },
                  {
                    "cwe_id": "CWE-296: Improper Following of a Certificate's Chain of Trust"
                  },
                  {
                    "cwe_id": "CWE-299: Improper Check for Certificate Revocation"
                  },
                  {
                    "cwe_id": "CWE-322: Key Exchange without Entity Authentication"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "motive": "Broker Stolen Account Data",
        "motive_description": "Centers around the illicit trade and monetization of customer account information. In this scenario, threat actors, often acting as intermediaries or brokers, facilitate the exchange of stolen account data in underground markets or among cybercriminal networks. The motive is primarily financial gain, where stolen account information is sold to other malicious actors who may use it for fraudulent activities, unauthorized access, or identity theft. Brokering stolen account data exacerbates the impact of the initial theft by widening its reach and potential for exploitation.",
        "components": [
          {
            "name": "Authentication token",
            "description": "",
            "sub_components": [
              {
                "name": "Authentication token",
                "dynamic": true,
                "tags": "tier: data; role: iam; match: authentication_type",
                "cwes": [
                  {
                    "cwe_id": "CWE-1275: Sensitive Cookie with Improper SameSite Attribute"
                  },
                  {
                    "cwe_id": "CWE-200: Exposure of Sensitive Information to an Unauthorized Actor"
                  },
                  {
                    "cwe_id": "CWE-284: Improper Access Control "
                  },
                  {
                    "cwe_id": "CWE-285: Improper Authorization"
                  },
                  {
                    "cwe_id": "CWE-290: Authentication Bypass by Spoofing"
                  },
                  {
                    "cwe_id": "CWE-294: Authentication Bypass by Capture-replay"
                  },
                  {
                    "cwe_id": "CWE-346: Origin Validation Error"
                  },
                  {
                    "cwe_id": "CWE-384: Session Fixation"
                  },
                  {
                    "cwe_id": "CWE-488: Exposure of Data Element to Wrong Session"
                  },
                  {
                    "cwe_id": "CWE-522: Insufficiently Protected Credentials "
                  },
                  {
                    "cwe_id": "CWE-539: Use of Persistent Cookies Containing Sensitive Information"
                  },
                  {
                    "cwe_id": "CWE-613: Insufficient Session Expiration"
                  },
                  {
                    "cwe_id": "CWE-664: Improper Control of a Resource Through its Lifetime"
                  },
                  {
                    "cwe_id": "CWE-732: Incorrect Permission Assignment for Critical Resource"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "motive": "Create a case for class action lawsuits on stolen information by app",
        "motive_description": "A strategic and malicious intent to use the stolen customer account information as evidence in legal proceedings. Threat actors aim to exploit the compromised data to build a case against the app or its operators, alleging negligence or inadequate security measures. This motive is characterized by an attempt to escalate the consequences of the data breach by orchestrating legal actions on behalf of affected individuals. It may involve collaboration with legal entities or attempting to incite legal challenges against the app owners, potentially resulting in significant financial and reputational damage.",
        "components": [
          {
            "name": "IAM Cloud Database or Public Access Control Service",
            "description": "e.g. - Okta, Ping, OpenID, Oracle IDM, etc.",
            "sub_components": [
              {
                "name": "IAM Cloud Database or Public Access Control Service",
                "dynamic": true,
                "tags": "tier: data; role: iam; match: authentication_type",
                "cwes": [
                  {
                    "cwe_id": "CWE-284: Improper Access Control "
                  },
                  {
                    "cwe_id": "CWE-522: Insufficiently Protected Credential"
                  }
                ]
              }
            ]
          },
          {
            "name": "Unprotected customer data store",
            "description": "",
            "sub_components": [
              {
                "name": "Unprotected customer data store",
                "dynamic": true,
                "tags": "tier: data; role: db; match: database_technologies, infrastructure_file_servers",
                "cwes": [
                  {
                    "cwe_id": "CWE-1268: Policy Privileges are not Assigned Consistently"
                  },
                  {
                    "cwe_id": "CWE-250: Execution with Unnecessary Privileges"
                  },
                  {
                    "cwe_id": "CWE-552: Files or Directories Accessible to External Parties"
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "threat": "Alter Financial Data/ Values in the Application",
    "threat_description": "Unauthorized manipulation of numerical, transactional, or other financial information within a system. This could include modifying account balances, transaction amounts, or any data related to financial operations. Threat actors may employ various techniques such as SQL injection, unauthorized access, or exploiting vulnerabilities to gain the ability to modify financial data.",
    "motives": [
      {
        "motive": "Change terms of loan",
        "motive_description": "A specific, malicious intent to manipulate financial data within an application to modify the conditions or details of existing loans. Threat actors with this motive seek to alter interest rates, repayment schedules, or loan amounts to their advantage. This could lead to financial losses for the affected individuals or organizations, as well as potential legal ramifications. The motive is typically driven by a desire for financial gain or to create chaos within the financial system by disrupting loan agreements and causing harm to borrowers or financial institutions.",
        "components": [
          {
            "name": "Application Database",
            "description": "",
            "sub_components": [
              {
                "name": "Application Database",
                "dynamic": true,
                "tags": "tier: data; role: db; match: database_technologies, infrastructure_file_servers",
                "cwes": [
                  {
                    "cwe_id": "CWE-1268: Policy Privileges are not Assigned Consistently"
                  },
                  {
                    "cwe_id": "CWE-250: Execution with Unnecessary Privileges"
                  },
                  {
                    "cwe_id": "CWE-269: Improper Privilege Management "
                  },
                  {
                    "cwe_id": "CWE-284: Improper Access Control "
                  },
                  {
                    "cwe_id": "CWE-522: Insufficiently Protected Credentials "
                  },
                  {
                    "cwe_id": "CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "motive": "Change terms of investment",
        "motive_description": "A specific and malicious intent to manipulate financial data within an application for the purpose of altering the conditions or details of existing investments. Threat actors with this motive seek to modify parameters such as interest rates, maturity dates, or investment amounts to their advantage. The goal is often to derive financial gain or disrupt the investment portfolio, potentially causing financial losses for investors or financial institutions. This type of threat poses significant risks to the integrity of investment systems and can have severe financial implications for individuals and organizations involved in the affected investments.",
        "components": [
          {
            "name": "Non-relational DB data store",
            "description": "",
            "sub_components": [
              {
                "name": "Non-relational DB data store",
                "dynamic": true,
                "tags": "tier: data; role: db; match: database_technologies, infrastructure_file_servers",
                "cwes": [
                  {
                    "cwe_id": "CWE-1286: Improper Validation of Syntactic Correctness of Input"
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "threat": "Disrupt Financial Markets via Financial System/ App",
    "threat_description": "Intentional actions to destabilize the normal functioning of financial institutions, trading platforms, or other components of the financial ecosystem. This threat could manifest as a cyber attack, manipulation of financial data, or exploiting vulnerabilities to cause disruptions in market operations, trading activities, or overall financial stability.",
    "motives": [
      {
        "motive": "Create economic instability",
        "motive_description": "To use the disruptions caused by the threat to sow chaos within the economy. Threat actors with this motive aim to generate uncertainty, fear, and a lack of confidence in financial systems. By creating economic instability, they may seek to manipulate markets, influence stock prices, or damage the reputation of financial institutions. This motive often aligns with broader agendas that may include financial terrorism, political motivations, or attempts to exploit market vulnerabilities for personal or ideological gain. The consequences can range from financial losses for investors to systemic risks affecting the broader economy. Addressing this motive requires robust cybersecurity measures, monitoring systems, and collaboration between financial institutions and regulatory bodies to mitigate the impact of potential disruptions.",
        "components": [
          {
            "name": "Upstream financial information providers",
            "description": "Frontend Apps/ systems that provide upstream financial info to broader systems and markets",
            "sub_components": [
              {
                "name": "Upstream financial information providers",
                "dynamic": true,
                "tags": "tier: data; role: db; match: database_technologies, infrastructure_file_servers",
                "cwes": [
                  {
                    "cwe_id": "CWE-269: Improper Privilege Management"
                  },
                  {
                    "cwe_id": "CWE-282: Improper Ownership Management"
                  },
                  {
                    "cwe_id": "CWE-286: Incorrect User Management"
                  },
                  {
                    "cwe_id": "CWE-287: Improper Authentication"
                  },
                  {
                    "cwe_id": "CWE-295: Improper Certificate Validation "
                  },
                  {
                    "cwe_id": "CWE-346: Origin Validation Error"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "motive": "Influence market outcomes to self-interest or private interest groups",
        "motive_description": "Exploit disruptions for personal gain or the benefit of specific interest groups. Threat actors with this motive seek to manipulate market conditions, stock prices, or financial instruments in a way that favors their own financial interests or those of a particular group. This may include insider trading, spreading false information to manipulate perceptions, or engaging in activities that result in favorable outcomes for specific investments.",
        "components": [
          {
            "name": "Network gateways transmitting transactions",
            "description": "Routers, switches, firewalls, proxies that may be transmitting transactions.",
            "sub_components": [
              {
                "name": "Network gateways transmitting transactions",
                "dynamic": true,
                "tags": "tier: data; role: db; match: database_technologies, infrastructure_file_servers",
                "cwes": [
                  {
                    "cwe_id": "CWE-657: Violation of Secure Design Principles"
                  },
                  {
                    "cwe_id": "CWE-269: Improper Privilege Management"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "motive": "Trigger regulatory inquiry based upon compromised system/ app",
        "motive_description": "Create circumstances that would attract the attention of regulatory bodies. Threat actors with this motive aim to exploit vulnerabilities in the financial system or application in a way that raises concerns about compliance, security, or integrity. By doing so, they seek to prompt regulatory investigations or inquiries into the affected financial entity.",
        "components": [
          {
            "name": "Backend systems or data servers",
            "description": "Backend financial systems or data servers that contain account, asset, trade information",
            "sub_components": [
              {
                "name": "Backend systems or data servers",
                "dynamic": true,
                "tags": "tier: data; role: db; match: database_technologies, infrastructure_file_servers",
                "cwes": [
                  {
                    "cwe_id": "CWE-200: Information Exposure"
                  },
                  {
                    "cwe_id": "CWE-306: Missing Authentication for Critical Function"
                  },
                  {
                    "cwe_id": "CWE-862: Missing Authorization"
                  },
                  {
                    "cwe_id": "CWE-285: Improper Authorization"
                  },
                  {
                    "cwe_id": "CWE-521: Weak Password Requirements"
                  },
                  {
                    "cwe_id": "CWE-829: Inclusion of Functionality from Untrusted Control Sphere"
                  },
                  {
                    "cwe_id": "CWE-327: Use of a Broken or Risky Cryptographic Algorithm"
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "threat": "Persist in App/ System related Infrastructure",
    "threat_description": "Unauthorized actors maintaining a lasting presence within the software or hardware components of a banking or financial system. This persistence could be achieved through various means such as malware, backdoors, or other stealthy techniques that allow threat actors to maintain access and observe activities over an extended period.",
    "motives": [
      {
        "motive": "Spy on banking/financial infrastructure",
        "motive_description": "Characterized by the intent to gather sensitive information, monitor transactions, and gain insights into the operations of financial systems. Threat actors with this motive seek to collect data related to financial transactions, user activities, or sensitive business operations for espionage purposes. This information could be used for financial gain, competitive advantage, or more malicious purposes such as conducting fraud or insider trading.",
        "components": [
          {
            "name": "Vulnerable OS",
            "description": "Endpoint or node with vulnerable OS where warez can be installed.",
            "sub_components": [
              {
                "name": "Vulnerable OS",
                "dynamic": true,
                "tags": "tier: application; role: backend; match: infrastructure_os",
                "cwes": [
                  {
                    "cwe_id": "CWE-250: Execution with Unnecessary Privileges"
                  },
                  {
                    "cwe_id": "CWE-284: Improper Access Control"
                  },
                  {
                    "cwe_id": "CWE-306: Missing Authentication for Critical Function"
                  },
                  {
                    "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
                  },
                  {
                    "cwe_id": "CWE-321: Use of Hard-coded Cryptographic Key"
                  },
                  {
                    "cwe_id": "CWE-327: Use of a Broken or Risky Cryptographic Algorithm"
                  },
                  {
                    "cwe_id": "CWE-522: Insufficiently Protected Credentials"
                  },
                  {
                    "cwe_id": "CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')"
                  },
                  {
                    "cwe_id": "CWE-862: Missing Authorization"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "motive": "Steal credentials on financial networks",
        "motive_description": "A specific and malicious intent to capture and compromise login credentials associated with financial systems. Threat actors with this motive aim to collect usernames, passwords, and other authentication details from users or administrators accessing financial networks. Stolen credentials can be used for unauthorized access, identity theft, or conducting fraudulent financial transactions.",
        "components": [
          {
            "name": "Client browser",
            "description": "",
            "sub_components": [
              {
                "name": "Client browser",
                "dynamic": true,
                "tags": "tier: application; role: backend; match: infrastructure_os",
                "cwes": [
                  {
                    "cwe_id": "CWE-295: Improper Certificate Validation"
                  },
                  {
                    "cwe_id": "CWE-311: Missing Encryption of Sensitive Data"
                  },
                  {
                    "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
                  },
                  {
                    "cwe_id": "CWE-321: Use of Hard-coded Cryptographic Key"
                  },
                  {
                    "cwe_id": "CWE-451: User Interface (UI) Misrepresentation of Critical Information"
                  },
                  {
                    "cwe_id": "CWE-522: Insufficiently Protected Credentials"
                  },
                  {
                    "cwe_id": "CWE-525: Use of Web Browser Cache Containing Sensitive Information"
                  },
                  {
                    "cwe_id": "CWE-539: Use of Persistent Cookies Containing Sensitive Information"
                  },
                  {
                    "cwe_id": "CWE-601: URL Redirection to Untrusted Site ('Open Redirect')"
                  },
                  {
                    "cwe_id": "CWE-602: Client-Side Enforcement of Server-Side Security"
                  },
                  {
                    "cwe_id": "CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')"
                  }
                ]
              }
            ]
          },
          {
            "name": "IAM",
            "description": "IAM, Azure AD, or Oauth credential store",
            "sub_components": [
              {
                "name": "IAM",
                "dynamic": true,
                "tags": "tier: data; role: iam; match: authentication_type",
                "cwes": [
                  {
                    "cwe_id": "CWE-209: Information Exposure Through an Error Message"
                  },
                  {
                    "cwe_id": "CWE-295: Improper Certificate Validation"
                  },
                  {
                    "cwe_id": "CWE-311: Missing Encryption of Sensitive Data"
                  },
                  {
                    "cwe_id": "CWE-315: Cleartext Storage of Sensitive Information in a Cookie"
                  },
                  {
                    "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
                  },
                  {
                    "cwe_id": "CWE-321: Use of Hard-coded Cryptographic Key"
                  },
                  {
                    "cwe_id": "CWE-330: Use of Insufficiently Random Values"
                  },
                  {
                    "cwe_id": "CWE-522: Insufficiently Protected Credentials"
                  },
                  {
                    "cwe_id": "CWE-601: URL Redirection to Untrusted Site ('Open Redirect')"
                  },
                  {
                    "cwe_id": "CWE-602: Client-Side Enforcement of Server-Side Security"
                  },
                  {
                    "cwe_id": "CWE-749: Exposed Dangerous Method or Function"
                  },
                  {
                    "cwe_id": "CWE-778: Insufficient Logging"
                  },
                  {
                    "cwe_id": "CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')"
                  },
                  {
                    "cwe_id": "CWE-798: Use of Hard-coded Credentials"
                  },
                  {
                    "cwe_id": "CWE-862: Missing Authorization"
                  },
                  {
                    "cwe_id": "CWE-306: Missing Authentication for Critical Function"
                  }
                ]
              }
            ]
          },
          {
            "name": "Token store",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-250: Execution with Unnecessary Privileges"
              },
              {
                "cwe_id": "CWE-295: Improper Certificate Validation"
              },
              {
                "cwe_id": "CWE-306: Missing Authentication for Critical Function"
              },
              {
                "cwe_id": "CWE-311: Missing Encryption of Sensitive Data"
              },
              {
                "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
              },
              {
                "cwe_id": "CWE-321: Use of Hard-coded Cryptographic Key"
              },
              {
                "cwe_id": "CWE-522: Insufficiently Protected Credentials"
              },
              {
                "cwe_id": "CWE-651: Insufficient Session Expiration"
              },
              {
                "cwe_id": "CWE-778: Insufficient Logging"
              },
              {
                "cwe_id": "CWE-798: Use of Hard-coded Credentials"
              },
              {
                "cwe_id": "CWE-862: Missing Authorization"
              }
            ]
          }
        ]
      },
      {
        "motive": "Selling persistence within financial networks ",
        "motive_description": "The motive to persistently sell persistence within financial networks involves threat actors intending to monetize their ability to maintain unauthorized access to financial systems. In this scenario, malicious actors seek to market and sell their expertise or tools for maintaining persistent access points to other cybercriminals or interested parties within the criminal underground.\nThis motive is driven by financial gain, as threat actors aim to profit from the illicit trade of tools, techniques, or access credentials that enable others to infiltrate and compromise financial networks. The consequences of this threat include an increased risk of secondary attacks, data breaches, and financial fraud conducted by buyers of the persistent access.",
        "components": [
          {
            "name": "3rd party library",
            "description": "COTS component in banking/ financial or embedded third party library ingested from untrusted software sources, extraneous to the bank or financial institution.",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-250: Execution with Unnecessary Privileges"
              },
              {
                "cwe_id": "CWE-494: Download of Code Without Integrity Check"
              },
              {
                "cwe_id": "CWE-502: Deserialization of Untrusted Data"
              },
              {
                "cwe_id": "CWE-506: Embedded Malicious Code"
              },
              {
                "cwe_id": "CWE-829: Inclusion of Functionality from Untrusted Control Sphere"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "threat": "Mine cryptocurency ",
    "threat_description": "Unauthorized cryptocurrency mining, also known as cryptojacking, involves an attacker secretly using a victim's computing resources to mine cryptocurrency. This threat typically targets systems with high computational power to maximize mining efficiency. Attackers might infiltrate systems through various means, including phishing, exploiting vulnerabilities, or injecting malicious scripts into websites. The threat is characterized by its stealth and persistence, aiming to remain undetected for as long as possible to maximize mining time.",
    "motives": [
      {
        "motive": "Money laundering",
        "motive_description": "Money laundering through cryptocurrency mining involves converting illicitly obtained funds into mined cryptocurrency to disguise their origin. This process generally involves three stages: placement (introducing illegal funds into the mining process), layering (conducting complex financial transactions to confuse the trail), and integration (reintroducing the laundered money back into the economy as legitimate cryptocurrency earnings).",
        "components": [
          {
            "name": "Payment gateway",
            "description": "Any app component that supports use cases to which money transfers are allowed, particularly large deposits or large money movement.",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-306: Missing Authentication for Critical Function"
              },
              {
                "cwe_id": "CWE-309: Use of Password System for Primary Authentication"
              },
              {
                "cwe_id": "CWE-311: Missing Encryption of Sensitive Data"
              },
              {
                "cwe_id": "CWE-316: Cleartext Storage of Sensitive Information in Memory"
              },
              {
                "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
              },
              {
                "cwe_id": "CWE-330: Use of Insufficiently Random Values"
              },
              {
                "cwe_id": "CWE-345: Insufficient Verification of Data Authenticity"
              },
              {
                "cwe_id": "CWE-352: Cross-Site Request Forgery (CSRF)"
              },
              {
                "cwe_id": "CWE-444: Inconsistent Interpretation of HTTP Requests ('HTTP Request Smuggling')"
              },
              {
                "cwe_id": "CWE-522: Insufficiently Protected Credentials"
              },
              {
                "cwe_id": "CWE-601: URL Redirection to Untrusted Site ('Open Redirect')"
              },
              {
                "cwe_id": "CWE-602: Client-Side Enforcement of Server-Side Security"
              },
              {
                "cwe_id": "CWE-78: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')"
              },
              {
                "cwe_id": "CWE-798: Use of Hard-coded Credentials"
              },
              {
                "cwe_id": "CWE-799: Improper Control of Interaction Frequency"
              },
              {
                "cwe_id": "CWE-862: Missing Authorization"
              },
              {
                "cwe_id": "CWE-94: Improper Control of Generation of Code ('Code Injection')"
              }
            ]
          }
        ]
      },
      {
        "motive": "Leverage powerful infrastructure to mine cryptocurrency",
        "motive_description": "The motive behind this threat is the exploitation of high-performance computing resources to efficiently mine cryptocurrency. Attackers target powerful infrastructure due to its superior processing capabilities, which can significantly increase the rate of cryptocurrency mining, thus maximizing the attacker's profits.",
        "components": [
          {
            "name": "Internet facing servers that are non-web",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-250: Execution with Unnecessary Privileges"
              },
              {
                "cwe_id": "CWE-285: Improper Authorization"
              },
              {
                "cwe_id": "CWE-295: Improper Certificate Validation"
              },
              {
                "cwe_id": "CWE-306: Missing Authentication for Critical Function"
              },
              {
                "cwe_id": "CWE-308: Use of Single-factor Authentication"
              },
              {
                "cwe_id": "CWE-522: Insufficiently Protected Credentials"
              },
              {
                "cwe_id": "CWE-602: Client-Side Enforcement of Server-Side Security"
              },
              {
                "cwe_id": "CWE-749: Exposed Dangerous Method or Function"
              },
              {
                "cwe_id": "CWE-798: Use of Hard-coded Credentials"
              },
              {
                "cwe_id": "CWE-862: Missing Authorization"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "threat": "Espionage of Financial Trades",
    "threat_description": "Espionage in financial trading systems involves unauthorized access and monitoring of sensitive financial trade information by attackers. This threat primarily targets financial institutions, trading platforms, and individual traders to gain insights into trading strategies, positions, and upcoming transactions. The attackers might employ various methods like infiltrating network systems, deploying malware, or conducting sophisticated cyber-attacks to access this confidential data. The intent is to covertly gather market intelligence without alerting the victims or disrupting the systems.",
    "motives": [
      {
        "motive": "Market intel gathering ",
        "motive_description": "The primary motive behind espionage of financial trades is to gather market intelligence. Attackers aim to gain unauthorized access to confidential trading information to derive insights about market trends, investment strategies, and future financial moves of competitors or the market at large. This intelligence is used to gain a competitive edge in financial markets, predict market movements, or engage in insider trading.",
        "components": [
          {
            "name": "Large financial transaction systems, clearinghouses",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-1295: Debug Messages Revealing Unnecessary Information"
              },
              {
                "cwe_id": "CWE-200: Information Exposure"
              },
              {
                "cwe_id": "CWE-202: Exposure of Sensitive Information Through Data Queries"
              },
              {
                "cwe_id": "CWE-285: Improper Authorization"
              },
              {
                "cwe_id": "CWE-287: Improper Authentication"
              },
              {
                "cwe_id": "CWE-311: Missing Encryption of Sensitive Data"
              },
              {
                "cwe_id": "CWE-312: Cleartext Storage of Sensitive Information"
              },
              {
                "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
              },
              {
                "cwe_id": "CWE-325: Missing Required Cryptographic Step"
              },
              {
                "cwe_id": "CWE-326: Inadequate Encryption Strength"
              },
              {
                "cwe_id": "CWE-522: Insufficiently Protected Credentials"
              },
              {
                "cwe_id": "CWE-778: Insufficient Logging"
              },
              {
                "cwe_id": "CWE-799: Improper Control of Interaction Frequency"
              }
            ]
          }
        ]
      },
      {
        "motive": "Economic espionage ",
        "motive_description": "Economic espionage refers to the act of illegally and covertly obtaining confidential financial or trade information for economic advantage. In the context of financial trade espionage, the motive is to acquire secret information about financial strategies, market movements, and trading tactics of corporations or individuals. This intelligence is used to gain an economic advantage in the market, whether by a competing business, a foreign government, or other entities seeking to benefit financially. The acquired information can be used to make strategic financial decisions, gain a competitive edge, manipulate markets, or engage in insider trading, all for economic gain.",
        "components": [
          {
            "name": "Data storage assets and databases",
            "description": "Data storage assets, relational databases that show patterns in deposits, xfrs & other investment or monetary movement.",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-20: Improper Input Validation"
              },
              {
                "cwe_id": "CWE-200: Information Exposure"
              },
              {
                "cwe_id": "CWE-285: Improper Authorization"
              },
              {
                "cwe_id": "CWE-305: Authentication Bypass by Primary Weakness"
              },
              {
                "cwe_id": "CWE-306: Missing Authentication for Critical Function"
              },
              {
                "cwe_id": "CWE-311: Missing Encryption of Sensitive Data"
              },
              {
                "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
              },
              {
                "cwe_id": "CWE-510: Trapdoor"
              },
              {
                "cwe_id": "CWE-530: Exposure of Backup File to an Unauthorized Control Sphere"
              },
              {
                "cwe_id": "CWE-778: Insufficient Logging"
              },
              {
                "cwe_id": "CWE-799: Improper Control of Interaction Frequency"
              },
              {
                "cwe_id": "CWE-829: Inclusion of Functionality from Untrusted Control Sphere"
              },
              {
                "cwe_id": "CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "threat": "Make fraudulent financial transfers ",
    "threat_description": "This threat involves the unauthorized and deliberate initiation of financial transfers from a victim's account to one controlled by the attacker. Attackers use various methods such as phishing, exploiting system vulnerabilities, identity theft, or manipulating transaction software to illicitly transfer funds. The focus is on bypassing security measures in financial systems to authorize transactions that are not initiated or intended by the account holder. The goal is to covertly transfer funds without alerting victims or triggering fraud detection systems, often targeting individuals, businesses, or financial institutions.",
    "motives": [
      {
        "motive": "Circumvent industry financial rules/sanctions",
        "motive_description": "The primary motive behind making fraudulent financial transfers in this context is to circumvent industry financial rules or international sanctions. Attackers engage in these activities to bypass regulations or sanctions that restrict certain financial transactions or international money movements. This could involve transferring funds to or from embargoed nations, dealing with blacklisted entities, or moving money in a manner that violates financial regulations. The intent is to exploit financial systems to achieve objectives that are otherwise restricted by regulatory frameworks, using fraudulent transfers as a means to subvert legal and financial oversight.",
        "components": [
          {
            "name": "Web applications with money transfer use cases",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-283: Unverified Ownership"
              },
              {
                "cwe_id": "CWE-285: Improper Authorization"
              },
              {
                "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
              },
              {
                "cwe_id": "CWE-330: Use of Insufficiently Random Values"
              },
              {
                "cwe_id": "CWE-345: Insufficient Verification of Data Authenticity"
              },
              {
                "cwe_id": "CWE-352: Cross-Site Request Forgery (CSRF)"
              },
              {
                "cwe_id": "CWE-601: URL Redirection to Untrusted Site ('Open Redirect')"
              },
              {
                "cwe_id": "CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')"
              },
              {
                "cwe_id": "CWE-837: Improper Enforcement of a Single, Unique Action"
              },
              {
                "cwe_id": "CWE-841: Improper Enforcement of Behavioral Workflow"
              },
              {
                "cwe_id": "CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')"
              }
            ]
          }
        ]
      },
      {
        "motive": "Circumvent Anti-Money Laundering requirements",
        "motive_description": "AML regulations are designed to prevent the illegal generation of income and its integration into the financial system. By conducting fraudulent transfers, attackers aim to move illicit funds in a way that evades AML detection and reporting mechanisms. This could involve breaking down large transactions into smaller ones (smurfing), using complex financial networks, or exploiting vulnerabilities in financial systems. The ultimate goal is to legitimize illegal funds, obscure their origins, and integrate them into the legitimate financial system without arousing the suspicion of regulatory bodies or law enforcement.",
        "components": [
          {
            "name": "Software imposed requirements to fund transfers",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-284: Improper Access Control"
              },
              {
                "cwe_id": "CWE-306: Missing Authentication for Critical Function"
              },
              {
                "cwe_id": "CWE-285: Improper Authorization"
              },
              {
                "cwe_id": "CWE-346: Origin Validation Error"
              },
              {
                "cwe_id": "CWE-74: Improper Neutralization of Special Elements in Output Used by a Downstream Component ('Injection')"
              },
              {
                "cwe_id": "CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')"
              },
              {
                "cwe_id": "CWE-94: Improper Control of Generation of Code ('Code Injection')"
              },
              {
                "cwe_id": "CWE-311: Missing Encryption of Sensitive Data"
              },
              {
                "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
              }
            ]
          }
        ]
      },
      {
        "motive": "Hide illicit financial fund transfers",
        "motive_description": "Attackers engaging in this activity aim to discreetly transfer money derived from illegal activities (such as drug trafficking, corruption, or other criminal enterprises) in a manner that evades detection by financial institutions and law enforcement agencies. The strategy often involves masking the origin and destination of the funds, using complex financial networks, shell companies, or third-party intermediaries. The ultimate goal is to obscure the trail of the illegal funds, making it difficult to trace them back to their criminal origins, thereby allowing the integration of these funds into the legitimate financial system without raising alarms.",
        "components": [
          {
            "name": "Any data source that records fund transfers for the purposes of altering log",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-532: Insertion of Sensitive Information in Log Files"
              },
              {
                "cwe_id": "CWE-778: Insufficient Logging"
              },
              {
                "cwe_id": "CWE-642: External Control of Critical State Data"
              },
              {
                "cwe_id": "CWE-117: Improper Output Neutralization for Logs"
              },
              {
                "cwe_id": "CWE-564: SQL Injection"
              },
              {
                "cwe_id": "CWE-444: Inconsistent Interpretation of HTTP Requests ('HTTP Request Smuggling')"
              },
              {
                "cwe_id": "CWE-470: Use of Externally-Controlled Input to Select Classes or Code ('Unsafe Reflection')"
              },
              {
                "cwe_id": "CWE-212: Improper Cross-boundary Removal of Sensitive Data"
              }
            ]
          },
          {
            "name": "Payment gateway",
            "description": "Any app use cases or call that conducts fund transfers",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-327: Use of a Broken or Risky Cryptographic Algorithm"
              },
              {
                "cwe_id": "CWE-311: Missing Encryption of Sensitive Data"
              },
              {
                "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
              },
              {
                "cwe_id": "CWE-778: Insufficient Logging"
              },
              {
                "cwe_id": "CWE-628: Function Call with Incorrectly Specified Arguments"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "threat": "Harvest app owner/ employee information",
    "threat_description": "Targeting and collection of personal and professional information of individuals associated with a specific app or company, particularly those in financial roles. Attackers employ various methods such as social engineering, phishing, exploiting public databases, or infiltrating corporate networks to gather details like names, job titles, email addresses, phone numbers, and even personal details of employees. The objective is to amass a comprehensive profile of individuals, which can be used for more targeted and sophisticated attacks. The information harvested is often used to create a sense of legitimacy in subsequent malicious activities, making them harder to detect.",
    "motives": [
      {
        "motive": "Perpetrate/impersonate financial employee ",
        "motive_description": "Attackers use the harvested information to pose as legitimate employees, often those in key financial roles, to gain access to sensitive financial data, systems, or to authorize fraudulent transactions. This impersonation can be used to deceive other employees, financial institutions, or clients into executing transactions, sharing confidential information, or performing actions that would otherwise be secure. The ultimate goal is to exploit the trust and authority vested in financial roles to facilitate unauthorized access or financial fraud.",
        "components": [
          {
            "name": "SaaS services using OAuth storing user profiles ",
            "description": "e.g. - Ping, Okta, other 3rd party SaaS",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-200: Information Exposure"
              },
              {
                "cwe_id": "CWE-307: Improper Restriction of Excessive Authentication Attempts"
              },
              {
                "cwe_id": "CWE-522: Insufficiently Protected Credentials"
              },
              {
                "cwe_id": "CWE-285: Improper Authorization"
              },
              {
                "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
              },
              {
                "cwe_id": "CWE-301: Reflection Attack in an Authentication Protocol"
              },
              {
                "cwe_id": "CWE-290: Authentication Bypass by Spoofing"
              },
              {
                "cwe_id": "CWE-520: .NET Misconfiguration: Use of Impersonation"
              },
              {
                "cwe_id": "CWE-556: ASP.NET Misconfiguration: Use of Identity Impersonation"
              }
            ]
          }
        ]
      },
      {
        "motive": "Gain unauthorized access to financial systems",
        "motive_description": "By collecting detailed information about individuals who have legitimate access to these systems, attackers can bypass security measures designed to protect financial data and transactions. This unauthorized access can be used for a range of malicious activities, including financial theft, data breaches, or further infiltration into the company's network. The goal is to exploit the access privileges of legitimate users to conduct unauthorized activities within financial systems without detection.",
        "components": [
          {
            "name": "Oauth/ Authorization server",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
              },
              {
                "cwe_id": "CWE-284: Improper Access Control"
              },
              {
                "cwe_id": "CWE-307: Improper Restriction of Excessive Authentication Attempts"
              },
              {
                "cwe_id": "CWE-522: Insufficiently Protected Credentials"
              },
              {
                "cwe_id": "CWE-285: Improper Authorization"
              },
              {
                "cwe_id": "CWE-862: Missing Authorization"
              },
              {
                "cwe_id": "CWE-798: Use of Hard-coded Credentials"
              }
            ]
          },
          {
            "name": "AD, LDAP server, Azure AD",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-284: Improper Access Control"
              },
              {
                "cwe_id": "CWE-307: Improper Restriction of Excessive Authentication Attempts"
              },
              {
                "cwe_id": "CWE-522: Insufficiently Protected Credentials"
              },
              {
                "cwe_id": "CWE-285: Improper Authorization"
              },
              {
                "cwe_id": "CWE-862: Missing Authorization"
              },
              {
                "cwe_id": "CWE-798: Use of Hard-coded Credentials"
              },
              {
                "cwe_id": "CWE-200: Information Exposure"
              },
              {
                "cwe_id": "CWE-319: Cleartext Transmission of Sensitive Information"
              },
              {
                "cwe_id": "CWE-260: Password in Configuration File"
              },
              {
                "cwe_id": "CWE-258: Empty Password in Configuration File"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "threat": "Extort the financial institution/ users of the app",
    "threat_description": "Coercing a financial institution or the users of a financial application into paying a ransom by holding their systems, data, or services hostage. Attackers may employ tactics such as deploying ransomware to lock down systems or encrypt critical data, launching Distributed Denial of Service (DDoS) attacks to disrupt service availability, or threatening to leak sensitive financial information. The strategy is to create a situation of urgency and helplessness for the institution or its users, compelling them to comply with the ransom demands to regain access or prevent public disclosure of sensitive data.",
    "motives": [
      {
        "motive": "Financial gain by holding financial system(s) hostage for a ransom",
        "motive_description": "Extorting financial institutions or app users is to achieve financial gain by exploiting their dependency on critical financial systems and data. Attackers recognize the high value and sensitivity of financial services and data, understanding that institutions or users are more likely to pay a ransom to avoid substantial financial losses, reputational damage, or regulatory penalties. This form of cyber extortion is driven by the expectation that the high stakes involved in financial operations make stakeholders more likely to comply with ransom demands quickly, providing a lucrative and often rapid financial return for the attackers.",
        "components": [
          {
            "name": "Unique, financial application platform or system",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-506: Embedded Malicious Code"
              },
              {
                "cwe_id": "CWE-400: Uncontrolled Resource Consumption ('Resource Exhaustion')"
              },
              {
                "cwe_id": "CWE-285: Improper Authorization"
              },
              {
                "cwe_id": "CWE-799: Improper Control of Interaction Frequency"
              },
              {
                "cwe_id": "CWE-250: Execution with Unnecessary Privileges"
              }
            ]
          }
        ]
      },
      {
        "motive": "Financial gain by holding account holders hostage for a ransom",
        "motive_description": "Financial gain achieved by extorting money from financial institutions or individual account holders. Attackers aim to capitalize on the vulnerability and urgency experienced by customers who are denied access to their financial assets or are at risk of having their sensitive financial data exposed. This form of cyber extortion is driven by the understanding that the personal and immediate impact on account holders increases the likelihood of the ransom being paid, as individuals or institutions seek to quickly restore access to funds or protect personal information. The attackers exploit the high-value nature of financial assets and the critical need for privacy in financial matters to pressure victims into complying with their ransom demands.",
        "components": [
          {
            "name": "Application server responsible for financial application processing",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-284: Improper Access Control"
              },
              {
                "cwe_id": "CWE-287: Improper Authentication"
              },
              {
                "cwe_id": "CWE-523: Unprotected Transport of Credentials"
              },
              {
                "cwe_id": "CWE-798: Use of Hard-coded Credentials"
              },
              {
                "cwe_id": "CWE-200: Information Exposure"
              }
            ]
          },
          {
            "name": "Data store with banking/ financial transaction information",
            "description": "",
            "sub_components": [],
            "cwes": [
              {
                "cwe_id": "CWE-200: Information Exposure"
              },
              {
                "cwe_id": "CWE-312: Cleartext Storage of Sensitive Information"
              },
              {
                "cwe_id": "CWE-522: Insufficiently Protected Credentials"
              },
              {
                "cwe_id": "CWE-209: Information Exposure Through an Error Message"
              },
              {
                "cwe_id": "CWE-327: Use of a Broken or Risky Cryptographic Algorithm"
              },
              {
                "cwe_id": "CWE-315: Cleartext Storage of Sensitive Information in a Cookie"
              },
              {
                "cwe_id": "CWE-311: Missing Encryption of Sensitive Data"
              },
              {
                "cwe_id": "CWE-922: Insecure Storage of Sensitive Information"
              }
            ]
          }
        ]
      }
    ]
  }
]
